app/controllers/server_accounts_controller.rb

SELECT COUNT(*) FROM [tblServerAccounts] WHERE (Active = 1) AND (AccountCode LIKE N'%%')
---
  def index
    flash[:notice] = nil

    if params[:show_inactive] == 'true'
      @server_accounts = ServerAccount.all

SELECT [tblServerAccounts].* FROM [tblServerAccounts] WHERE (Id = N'4028')
---
  def test_connection
    begin
      @is_test_connection_failed = false
      h = {}
      @notice = ''
      if !params[:id].blank? && params[:is_editing] == 'false'
        db = ServerAccount.where('Id = ?', params[:id])